import streamlit as st

st.title("🔹 অধ্যায় ১: পরিচিতি")

st.header("Streamlit কী?")

st.write("""
Streamlit একটি ওপেন সোর্স Python লাইব্রেরি যেটি দিয়ে আপনি খুব সহজেই ইন্টার‌্যাকটিভ ওয়েব অ্যাপ বানাতে পারেন শুধুমাত্র Python কোড ব্যবহার করে।

এটি বিশেষভাবে ডেটা সায়েন্টিস্ট, এনালিস্ট এবং মেশিন লার্নিং ডেভেলপারদের জন্য ডিজাইন করা হয়েছে যাতে তারা খুব কম সময়ে প্রোটোটাইপ তৈরি করতে পারে।
""")

st.header("স্ট্রিমলিটের সুবিধা:")

st.write("""
🔹 শুধু Python জানলেই ওয়েব অ্যাপ তৈরি করা যায়  
🔹 খুব দ্রুত রান করে  
🔹 কোনো HTML, CSS, JavaScript জানার দরকার নেই  
🔹 সহজভাবে ডেটা ভিজুয়ালাইজেশন করা যায়  
""")

st.header("কোথায় ব্যবহার হয়?")

st.write("""
🔹 ডেটা বিশ্লেষণ  
🔹 মেশিন লার্নিং প্রজেক্ট  
🔹 রিয়েল টাইম রিপোর্টিং  
🔹 ইন্টারেকটিভ টুলস তৈরি  
""")

st.header(" অন্যান্য ওয়েব ফ্রেমওয়ার্ক থেকে পার্থক্য")
st.write("""
| বিষয় | Streamlit | Django / Flask |
|------|-----------|----------------|
| শিখতে সহজ | ✅ খুব সহজ | ❌ তুলনামূলক কঠিন |
| ফ্রন্টএন্ড কোড লাগে? | ❌ না | ✅ হ্যাঁ |
| ব্যবহারের উদ্দেশ্য | ✅ দ্রুত প্রোটোটাইপ | ✅ ফুল স্ট্যাক ডেভ |
| রিয়েল টাইম রান | ✅ হ্যাঁ | ❌ সাধারণত না |
""")

st.header(" কেন Streamlit?")
st.write("""
🔹 শুধু Python জানলেই আপনি শুরু করতে পারবেন  
🔹 Data Visualization-এর জন্য built-in support  
🔹 দ্রুত তৈরি ও শেয়ার করা যায়  
🔹 Rapid prototyping এর জন্য আদর্শ  
🔹 কোড রিফ্রেশের সাথে সাথেই আপডেট হয়  
""")